In [5]:
import pandas as pd
import numpy as np


# x = np.array([1, 5, 6, 9, 8, 7, 3])

# series = pd.Series(x)
# print(series)

z = pd.Series(np.linspace(start=1, stop=2, num=20))
print(z)

0     1.000000
1     1.052632
2     1.105263
3     1.157895
4     1.210526
5     1.263158
6     1.315789
7     1.368421
8     1.421053
9     1.473684
10    1.526316
11    1.578947
12    1.631579
13    1.684211
14    1.736842
15    1.789474
16    1.842105
17    1.894737
18    1.947368
19    2.000000
dtype: float64

In [6]:
z = pd.Series([1,5,9,7,8,6,3])
print(z)

0    1
1    5
2    9
3    7
4    8
5    6
6    3
dtype: int64

In [7]:
z.index = ['a','b','c','d','e','f','g']
print(z)

a    1
b    5
c    9
d    7
e    8
f    6
g    3
dtype: int64

In [8]:
s1 = {1,2,3,4,5,6,7,8,9,10}
s1

{1, 2, 3, 4, 5, 6, 7, 8, 9, 10}

In [9]:
type(s1)

set

In [17]:
s = pd.Series(tuple(s1))
s

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [23]:
df = pd.DataFrame(s1, columns=['set value'])
df

   set value
0          1
1          2
2          3
3          4
4          5
5          6
6          7
7          8
8          9
9         10

In [25]:
t = (1,2,3,4,5,6,7,8,9,10)
s = pd.Series(t)
s

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [27]:
df = pd.DataFrame(t)
df

    0
0   1
1   2
2   3
3   4
4   5
5   6
6   7
7   8
8   9
9  10

In [29]:
t = (1,2,3,4,5,6,7,8,True,False)
s = pd.Series(t)
s

0        1
1        2
2        3
3        4
4        5
5        6
6        7
7        8
8     True
9    False
dtype: object

In [31]:
df = pd.DataFrame(t)
df

       0
0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8   True
9  False

In [33]:
data = {'Age': [10,25,60,18,19,12,20,23],
       'Salary': [50000,25000,30000,8000,10000,15000,7000,13000]}
df = pd.DataFrame(data)
df

   Age  Salary
0   10   50000
1   25   25000
2   60   30000
3   18    8000
4   19   10000
5   12   15000
6   20    7000
7   23   13000

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     8 non-null      int64
 1   Salary  8 non-null      int64
dtypes: int64(2)
memory usage: 260.0 bytes

In [39]:
df.dtypes

Age       int64
Salary    int64
dtype: object

In [41]:
df['Age'] = df['Age'].astype('int32')
df['Salary'] = df['Salary'].astype('int32')
df

   Age  Salary
0   10   50000
1   25   25000
2   60   30000
3   18    8000
4   19   10000
5   12   15000
6   20    7000
7   23   13000

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     8 non-null      int32
 1   Salary  8 non-null      int32
dtypes: int32(2)
memory usage: 196.0 bytes

In [51]:
df['Age'] = df['Age'].astype('int16')
df['Salary'] = df['Salary'].astype('int16')
df

   Age  Salary
0   10  -15536
1   25   25000
2   60   30000
3   18    8000
4   19   10000
5   12   15000
6   20    7000
7   23   13000

In [53]:
data = {'Name': ['Rashedul', 'Zannat', 'Rishan'],
        'Age': [27, 24, 22],
        'Occupation': ['Data Scientist', 'Software Engineer', 'Teacher'],
        'Salary': [60000, 55000, 70000]
       }

In [55]:
data

{'Name': ['Rashedul', 'Zannat', 'Rishan'],
 'Age': [27, 24, 22],
 'Occupation': ['Data Scientist', 'Software Engineer', 'Teacher'],
 'Salary': [60000, 55000, 70000]}

In [59]:
df = pd.DataFrame(data)
print(df.dtypes)

Name          object
Age            int64
Occupation    object
Salary         int64
dtype: object

In [61]:
df

       Name  Age         Occupation  Salary
0  Rashedul   27     Data Scientist   60000
1    Zannat   24  Software Engineer   55000
2    Rishan   22            Teacher   70000

In [63]:
# Create a list of dates
dates = ['2023-10-04', '2024-11-15', '2025-01-01']

# Create a DataFrame with a datetime column
df1 = pd.DataFrame({'Date': dates})

# Check the data type of the 'Date' column
df1['Date'].dtype

dtype('O')

In [69]:
timestamps = pd.to_datetime(dates)
df2 = pd.DataFrame({'Date2': timestamps})
df2

       Date2
0 2023-10-04
1 2024-11-15
2 2025-01-01

In [67]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date2   3 non-null      datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 156.0 bytes